micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_rcc.h
/**
  * @brief  Configure UARTx clock source
  * @rmtoll CCIPR13      UART4SEL      LL_RCC_SetUARTClockSource\n
  *         CCIPR13      UART5SEL      LL_RCC_SetUARTClockSource\n
  *         CCIPR13      UART7SEL      LL_RCC_SetUARTClockSource\n
  *         CCIPR13      UART8SEL      LL_RCC_SetUARTClockSource\n
  *         CCIPR14      UART9SEL      LL_RCC_SetUARTClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_HSI
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUARTClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure USBx clock source
  * @rmtoll CCIPR6      OTGPHY1SEL        LL_RCC_GetUSBClockSource\n
  *         CCIPR6      OTGPHY1CKREFSEL   LL_RCC_GetUSBClockSource\n
  *         CCIPR6      OTGPHY2SEL        LL_RCC_GetUSBClockSource\n
  *         CCIPR6      OTGPHY2CKREFSEL   LL_RCC_GetUSBClockSource\n
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE_OTGPHY1
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE_OTGPHY2
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE_HSE_DIV_2_OSC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetUSBClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Configure XSPIx Kernel clock source
  * @rmtoll CCIPR6         XSPI1SEL        LL_RCC_SetXSPIClockSource\n
  *         CCIPR6         XSPI2SEL        LL_RCC_SetXSPIClockSource\n
  *         CCIPR6         XSPI3SEL        LL_RCC_SetXSPIClockSource
  * @param  ClkSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_IC4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetXSPIClockSource(uint32_t ClkSource)
{
  LL_RCC_SetClockSource(ClkSource);
}

/**
  * @brief  Get periph clock source
  * @rmtoll CCIPR1      *     LL_RCC_GetClockSource\n
  *         CCIPR3      *     LL_RCC_GetClockSource\n
  *         CCIPR4      *     LL_RCC_GetClockSource\n
  *         CCIPR6      *     LL_RCC_GetClockSource\n
  *         CCIPR7      *     LL_RCC_GetClockSource\n
  *         CCIPR8      *     LL_RCC_GetClockSource\n
  *         CCIPR9      *     LL_RCC_GetClockSource\n
  *         CCIPR12     *     LL_RCC_GetClockSource\n
  *         CCIPR13     *     LL_RCC_GetClockSource\n
  *         CCIPR14     *     LL_RCC_GetClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE
  *         @arg @ref LL_RCC_UART7_CLKSOURCE
  *         @arg @ref LL_RCC_UART8_CLKSOURCE
  *         @arg @ref LL_RCC_UART9_CLKSOURCE
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  *         @arg @ref LL_RCC_USART3_CLKSOURCE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE
  *         @arg @ref LL_RCC_USART10_CLKSOURCE
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE_OTGPHY1
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE_OTGPHY2
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_SPDIFRX1
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_SPDIFRX1
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_IC5
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_IC5
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_XSPI1_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_XSPI2_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_XSPI3_CLKSOURCE_IC4
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_GetClockSource(uint32_t Periph)
{
  const volatile uint32_t *pReg = (uint32_t *)((uint32_t)((uint32_t)(&RCC->CCIPR1) + LL_CLKSOURCE_REG(Periph)));
  return (uint32_t)(Periph | (((READ_BIT(*pReg, LL_CLKSOURCE_MASK(Periph))) >> LL_CLKSOURCE_SHIFT(Periph)) << LL_RCC_CONFIG_SHIFT));
}

/**
  * @brief  Get ADC Kernel clock source
  * @rmtoll CCIPR1       ADC12SEL       LL_RCC_GetADCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_ADC_CLKSOURCE_TIMG
  */
__STATIC_INLINE uint32_t LL_RCC_GetADCClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_ADC12SEL));
}

/**
  * @brief  Get ADFx clock source
  * @rmtoll CCIPR1       ADF1SEL        LL_RCC_GetADFClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE_TIMG
  */
__STATIC_INLINE uint32_t LL_RCC_GetADFClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_ADF1SEL));
}

/**
  * @brief  Get CLKP Kernel clock source
  * @rmtoll CCIPR7         PERSEL         LL_RCC_GetCLKPClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_IC19
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_IC5
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_CLKP_CLKSOURCE_IC20
  */
__STATIC_INLINE uint32_t LL_RCC_GetCLKPClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR7, RCC_CCIPR7_PERSEL));
}

/**
  * @brief  Get DCMIPP clock source
  * @rmtoll CCIPR1       DCMIPPSEL        LL_RCC_GetDCMIPPClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_PCLK5
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_IC17
  *         @arg @ref LL_RCC_DCMIPP_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetDCMIPPClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_DCMIPPSEL));
}

/**
  * @brief  Get ETHx Kernel clock source
  * @rmtoll CCIPR2        ETH1CLKSEL     LL_RCC_GetETHClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_IC12
  *         @arg @ref LL_RCC_ETH1_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ETH1CLKSEL));
}

/**
  * @brief  Get ETHx PTP Kernel clock source
  * @rmtoll CCIPR2        ETH1PTPSEL     LL_RCC_GetETHPTPClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_IC13
  *         @arg @ref LL_RCC_ETH1PTP_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHPTPClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ETH1PTPSEL));
}

/**
  * @brief  Get ETHx PHY interface
  * @rmtoll CCIPR2        ETH1SEL        LL_RCC_GetETHPHYInterface
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1PHY_IF
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1PHY_IF_MII
  *         @arg @ref LL_RCC_ETH1PHY_IF_RGMII
  *         @arg @ref LL_RCC_ETH1PHY_IF_RMII
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHPHYInterface(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ETH1SEL));
}

