micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_rcc.h
/**
  * @brief  Get ETHx Reference RX Kernel clock source
  * @rmtoll CCIPR2        ETH1REFCLKSEL  LL_RCC_GetETHREFRXClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REFRX_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REFRX_CLKSOURCE_EXT
  *         @arg @ref LL_RCC_ETH1REFRX_CLKSOURCE_INT
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHREFRXClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ETH1REFCLKSEL));
}

/**
  * @brief  Get ETHx Reference TX Kernel clock source
  * @rmtoll CCIPR2        ETH1GTXCLKSEL  LL_RCC_GetETHREFTXClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REFTX_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ETH1REFTX_CLKSOURCE_EXT
  *         @arg @ref LL_RCC_ETH1REFTX_CLKSOURCE_INT
  */
__STATIC_INLINE uint32_t LL_RCC_GetETHREFTXClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_ETH1GTXCLKSEL));
}

/**
  * @brief  Get FDCAN Kernel clock source
  * @rmtoll CCIPR3       FDCANSEL        LL_RCC_GetFDCANClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_IC19
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetFDCANClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_FDCANSEL));
}

/**
  * @brief  Get FMC Kernel clock source
  * @rmtoll CCIPR3         FMCSEL        LL_RCC_GetFMCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FMC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_IC3
  *         @arg @ref LL_RCC_FMC_CLKSOURCE_IC4
  */
__STATIC_INLINE uint32_t LL_RCC_GetFMCClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_FMCSEL));
}

/**
  * @brief  Get I2Cx clock source
  * @rmtoll CCIPR4       I2C1SEL       LL_RCC_GetI2CClockSource\n
  * @rmtoll CCIPR4       I2C2SEL       LL_RCC_GetI2CClockSource\n
  * @rmtoll CCIPR4       I2C3SEL       LL_RCC_GetI2CClockSource\n
  * @rmtoll CCIPR4       I2C4SEL       LL_RCC_GetI2CClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetI2CClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get I3Cx clock source
  * @rmtoll CCIPR4       I3C1SEL       LL_RCC_GetI3CClockSource\n
  * @rmtoll CCIPR4       I3C2SEL       LL_RCC_GetI3CClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_IC10
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetI3CClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get LPTIM clock source
  * @rmtoll CCIPR12      LPTIM1SEL     LL_RCC_GetLPTIMClockSource\n
  *         CCIPR12      LPTIM2SEL     LL_RCC_GetLPTIMClockSource\n
  *         CCIPR12      LPTIM3SEL     LL_RCC_GetLPTIMClockSource\n
  *         CCIPR12      LPTIM4SEL     LL_RCC_GetLPTIMClockSource\n
  *         CCIPR12      LPTIM5SEL     LL_RCC_GetLPTIMClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM3_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM4_CLKSOURCE_TIMG
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LPTIM5_CLKSOURCE_TIMG
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPTIMClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get LPUART clock source
  * @rmtoll CCIPR14       LPUART1SEL     LL_RCC_GetLPUARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_LPUART1_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUARTClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR14, RCC_CCIPR14_LPUART1SEL));
}

/**
  * @brief  Get LTDC clock source
  * @rmtoll CCIPR4        LTDCSEL     LL_RCC_GetLTDCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LTDC_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LTDC_CLKSOURCE_PCLK5
  *         @arg @ref LL_RCC_LTDC_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_LTDC_CLKSOURCE_IC16
  *         @arg @ref LL_RCC_LTDC_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetLTDCClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR4, RCC_CCIPR4_LTDCSEL));
}

/**
  * @brief  Get MDFx clock source
  * @rmtoll CCIPR5       MDF1SEL        LL_RCC_GetMDFClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_MDF1_CLKSOURCE_TIMG
  */
__STATIC_INLINE uint32_t LL_RCC_GetMDFClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR5, RCC_CCIPR5_MDF1SEL));
}

/**
  * @brief  Get OTGPHY clock source
  * @rmtoll CCIPR6       OTGPHY1SEL        LL_RCC_GetOTGPHYClockSource\n
  *         CCIPR6       OTGPHY2SEL        LL_RCC_GetOTGPHYClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_OTGPHY1_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_IC15
  *         @arg @ref LL_RCC_OTGPHY2_CLKSOURCE_HSE_DIV_2_OSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetOTGPHYClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get OTGPHYCKREF clock source
  * @rmtoll CCIPR6       OTGPHY1CKREFSEL   LL_RCC_GetOTGPHYCKREFClockSource\n
  *         CCIPR6       OTGPHY2CKREFSEL   LL_RCC_GetOTGPHYCKREFClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE_OTGPHY1
  *         @arg @ref LL_RCC_OTGPHY1CKREF_CLKSOURCE_HSE_DIV_2_OSC
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE_OTGPHY2
  *         @arg @ref LL_RCC_OTGPHY2CKREF_CLKSOURCE_HSE_DIV_2_OSC
  */
__STATIC_INLINE uint32_t LL_RCC_GetOTGPHYCKREFClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get PSSI clock source
  * @rmtoll CCIPR7      PSSISEL      LL_RCC_GetPSSIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_PSSI_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PSSI_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_PSSI_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_PSSI_CLKSOURCE_IC20
  *         @arg @ref LL_RCC_PSSI_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetPSSIClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR7, RCC_CCIPR7_PSSISEL));
}

/**
  * @brief  Get SAIx clock source
  * @rmtoll CCIPR7     SAI1SEL      LL_RCC_GetSAIClockSource\n
  *         CCIPR7     SAI2SEL      LL_RCC_GetSAIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE_SPDIFRX1
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SAI2_CLKSOURCE_SPDIFRX1
  */
__STATIC_INLINE uint32_t LL_RCC_GetSAIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get SDMMC clock source
  * @rmtoll CCIPR8      SDMMC1SEL      LL_RCC_GetSDMMCClockSource\n
  *         CCIPR8      SDMMC2SEL      LL_RCC_GetSDMMCClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE_IC5
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_HCLK
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_IC4
  *         @arg @ref LL_RCC_SDMMC2_CLKSOURCE_IC5
  */
__STATIC_INLINE uint32_t LL_RCC_GetSDMMCClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get SPDIFRX Kernel clock source
  * @rmtoll CCIPR9      SPDIFRX1SEL        LL_RCC_GetSPDIFRXClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_IC7
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPDIFRX1_CLKSOURCE_I2S_CKIN
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPDIFRXClockSource(uint32_t Periph)
{
  UNUSED(Periph);
  return (uint32_t)(READ_BIT(RCC->CCIPR9, RCC_CCIPR9_SPDIFRX1SEL));
}

/**
  * @brief  Get SPIx Kernel clock source
  * @rmtoll CCIPR9     SPI1SEL         LL_RCC_GetSPIClockSource\n
  *         CCIPR9     SPI2SEL         LL_RCC_GetSPIClockSource\n
  *         CCIPR9     SPI3SEL         LL_RCC_GetSPIClockSource\n
  *         CCIPR9     SPI4SEL         LL_RCC_GetSPIClockSource\n
  *         CCIPR9     SPI5SEL         LL_RCC_GetSPIClockSource\n
  *         CCIPR9     SPI6SEL         LL_RCC_GetSPIClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI1_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI2_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI3_CLKSOURCE_I2S_CKIN
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI4_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI5_CLKSOURCE_HSE
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_PCLK4
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_IC8
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_SPI6_CLKSOURCE_I2S_CKIN
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPIClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get USARTx clock source
  * @rmtoll CCIPR13        USART1SEL      LL_RCC_GetUSARTClockSource\n
  *         CCIPR13        USART2SEL      LL_RCC_GetUSARTClockSource\n
  *         CCIPR13        USART3SEL      LL_RCC_GetUSARTClockSource\n
  *         CCIPR13        USART6SEL      LL_RCC_GetUSARTClockSource\n
  *         CCIPR14        USART10SEL     LL_RCC_GetUSARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE
  *         @arg @ref LL_RCC_USART3_CLKSOURCE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE
  *         @arg @ref LL_RCC_USART10_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART1_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART2_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART3_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART6_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_USART10_CLKSOURCE_HSI
  */
__STATIC_INLINE uint32_t LL_RCC_GetUSARTClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

/**
  * @brief  Get USARTx clock source
  * @rmtoll CCIPR13        UART4SEL      LL_RCC_GetUARTClockSource\n
  *         CCIPR13        UART5SEL      LL_RCC_GetUARTClockSource\n
  *         CCIPR13        UART7SEL      LL_RCC_GetUARTClockSource\n
  *         CCIPR13        UART8SEL      LL_RCC_GetUARTClockSource\n
  *         CCIPR14        UART9SEL      LL_RCC_GetUARTClockSource
  * @param  Periph This parameter can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE
  *         @arg @ref LL_RCC_UART7_CLKSOURCE
  *         @arg @ref LL_RCC_UART8_CLKSOURCE
  *         @arg @ref LL_RCC_UART9_CLKSOURCE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART4_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART5_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART7_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_PCLK1
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART8_CLKSOURCE_HSI
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_PCLK2
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_CLKP
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_IC9
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_IC14
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_MSI
  *         @arg @ref LL_RCC_UART9_CLKSOURCE_HSI
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_GetUARTClockSource(uint32_t Periph)
{
  return LL_RCC_GetClockSource(Periph);
}

