micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_rcc.h
/**
  * @brief  Get the oscillator used as PLL clock source.
  * @rmtoll PLL3CFGR1      PLL3SEL        LL_RCC_PLL3_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_MSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  *         @arg @ref LL_RCC_PLLSOURCE_I2S_CKIN
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3SEL));
}

/**
  * @brief  Enable PLL3
  * @rmtoll CSR          PLL3ONS         LL_RCC_PLL3_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_Enable(void)
{
  WRITE_REG(RCC->CSR, RCC_CSR_PLL3ONS);
}

/**
  * @brief  Disable PLL3
  * @note Cannot be disabled if the PLL3 clock is used as the system clock
  * @rmtoll CCR          PLL3ONC         LL_RCC_PLL3_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_Disable(void)
{
  WRITE_REG(RCC->CCR, RCC_CCR_PLL3ONC);
}

/**
  * @brief  Check if PLL3 Ready
  * @rmtoll SR           PLL3RDY         LL_RCC_PLL3_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsReady(void)
{
  return ((READ_BIT(RCC->SR, RCC_SR_PLL3RDY) == (RCC_SR_PLL3RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL3 bypass (PLL3 output is driven by the PLL3 reference clock)
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR1    PLL3BYP         LL_RCC_PLL3_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_EnableBypass(void)
{
  SET_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3BYP);
}

/**
  * @brief  Disable PLL3 bypass (PLL3 output is driven by the VCO)
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR1    PLL3BYP         LL_RCC_PLL3_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_DisableBypass(void)
{
  CLEAR_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3BYP);
}

/**
  * @brief  Check if PLL3 bypass is enabled
  * @rmtoll PLL3CFGR1    PLL3BYP         LL_RCC_PLL3_IsEnabledBypass
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsEnabledBypass(void)
{
  return ((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3BYP) == RCC_PLL3CFGR1_PLL3BYP) ? 1UL : 0UL);
}

/**
  * @brief  Assert PLL3 modulation spread-spectrum reset
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3MODSSRST    LL_RCC_PLL3_AssertModulationSpreadSpectrumReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_AssertModulationSpreadSpectrumReset(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSSRST);
}

/**
  * @brief  Release PLL3 modulation spread-spectrum reset
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3MODSSRST    LL_RCC_PLL3_ReleaseModulationSpreadSpectrumReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_ReleaseModulationSpreadSpectrumReset(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSSRST);
}

/**
  * @brief  Enable PLL3 noise canceling DAC in fractional mode
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3DACEN       LL_RCC_PLL3_EnableDAC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_EnableDAC(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3DACEN);
}

/**
  * @brief  Disable PLL3 noise canceling DAC in fractional mode
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3DACEN     LL_RCC_PLL3_DisableDAC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_DisableDAC(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3DACEN);
}

/**
  * @brief  Check if PLL3 noise canceling DAC in fractional mode is enabled
  * @rmtoll PLL3CFGR3    PLL3DACEN     LL_RCC_PLL3_IsEnabledDAC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsEnabledDAC(void)
{
  return ((READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3DACEN) == RCC_PLL3CFGR3_PLL3DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL3 modulation spread-spectrum with fractional divide inactive
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3MODSSDIS    LL_RCC_PLL3_EnableModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_EnableModulationSpreadSpectrum(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSSDIS);
}

/**
  * @brief  Disable PLL3 modulation spread-spectrum but active fractional divide
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3MODSSDIS    LL_RCC_PLL3_DisableModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_DisableModulationSpreadSpectrum(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSSDIS);
}

/**
  * @brief  Check if PLL3 modulation spread-spectrum and inactive fractional divide is enabled
  * @rmtoll PLL3CFGR3    PLL3MODSSDIS    LL_RCC_PLL3_IsEnabledModulationSpreadSpectrum
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsEnabledModulationSpreadSpectrum(void)
{
  return ((READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODSSDIS) == 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL3 fractional divide and modulation spread-spectrum
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3MODDSEN     LL_RCC_PLL3_EnableFractionalModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_EnableFractionalModulationSpreadSpectrum(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODDSEN);
}

/**
  * @brief  Disable PLL3 fractional divide and modulation spread-spectrum
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3MODDSEN     LL_RCC_PLL3_DisableFractionalModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3_DisableFractionalModulationSpreadSpectrum(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODDSEN);
}

/**
  * @brief  Check if PLL3 fractional divide and modulation spread-spectrum is enabled
  * @rmtoll PLL3CFGR3    PLL3MODDSEN     LL_RCC_PLL3_IsEnabledFractionalModulationSpreadSpectrum
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_IsEnabledFractionalModulationSpreadSpectrum(void)
{
  return ((READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3MODDSEN) == RCC_PLL3CFGR3_PLL3MODDSEN) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL3 DIVN Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR1    PLL3DIVN        LL_RCC_PLL3_SetN
  * @param  N  In integer mode, N parameter can be a value between 16 (0x10) and 2500 (0x9C4).
  *         In fractional mode, N parameter can be a value between 20 (0x14) and 500 (0x1F4).
  */
__STATIC_INLINE void LL_RCC_PLL3_SetN(uint32_t N)
{
  MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3DIVN, N << RCC_PLL3CFGR1_PLL3DIVN_Pos);
}

/**
  * @brief  Get PLL3 DIVN Coefficient
  * @rmtoll PLL3CFGR1    PLL3DIVN        LL_RCC_PLL3_GetN
  * @retval In integer mode, a value between 16 (0x10) and 2500 (0x9C4).
  *         In fractional mode, a value between 20 (0x14) and 500 (0x1F4).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetN(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3DIVN) >> RCC_PLL3CFGR1_PLL3DIVN_Pos));
}

/**
  * @brief  Set PLL3 DIVM Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR1    PLL3DIVM        LL_RCC_PLL3_SetM
  * @param  M parameter can be a value between 1 and 63
  */
__STATIC_INLINE void LL_RCC_PLL3_SetM(uint32_t M)
{
  MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3DIVM, M << RCC_PLL3CFGR1_PLL3DIVM_Pos);
}

/**
  * @brief  Get PLL3 DIVM Coefficient
  * @rmtoll PLL3CFGR1    PLL3DIVM        LL_RCC_PLL3_GetM
  * @retval A value between 1 and 63
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetM(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR1, RCC_PLL3CFGR1_PLL3DIVM) >> RCC_PLL3CFGR1_PLL3DIVM_Pos);
}

/**
  * @brief  Set PLL3 PDIV1 Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3PDIV1       LL_RCC_PLL3_SetP1
  * @param  P1 parameter can be a value between 1 and 7 when PLL3 is enabled, 0 when disabled
  */
__STATIC_INLINE void LL_RCC_PLL3_SetP1(uint32_t P1)
{
  MODIFY_REG(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIV1, P1 << RCC_PLL3CFGR3_PLL3PDIV1_Pos);
}

/**
  * @brief  Get PLL3 PDIV2 Coefficient
  * @rmtoll PLL3CFGR3    PLL3PDIV1       LL_RCC_PLL3_GetP1
  * @retval A value between 1 and 7
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetP1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIV1) >> RCC_PLL3CFGR3_PLL3PDIV1_Pos);
}

/**
  * @brief  Set PLL3 PDIV2 Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3    PLL3PDIV2       LL_RCC_PLL3_SetP2
  * @param  P2 parameter can be a value between 0 and 7
  */
__STATIC_INLINE void LL_RCC_PLL3_SetP2(uint32_t P2)
{
  MODIFY_REG(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIV2, P2 << RCC_PLL3CFGR3_PLL3PDIV2_Pos);
}

/**
  * @brief  Get PLL3 PDIV2 Coefficient
  * @rmtoll PLL3CFGR3    PLL3PDIV2       LL_RCC_PLL3_GetP2
  * @retval A value between 1 and 7
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetP2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIV2) >> RCC_PLL3CFGR3_PLL3PDIV2_Pos);
}

/**
  * @brief  Enable PLL3P
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3           PLL3PDIVEN         LL_RCC_PLL3P_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3P_Enable(void)
{
  SET_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIVEN);
}

/**
  * @brief  Disable PLL3P
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR3           PLL3PDIVEN         LL_RCC_PLL3P_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL3P_Disable(void)
{
  CLEAR_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIVEN);
}

/**
  * @brief  Check if PLL3 P is enabled
  * @rmtoll PLL3CFGR3           PLL3PDIVEN         LL_RCC_PLL3P_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3P_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL3CFGR3, RCC_PLL3CFGR3_PLL3PDIVEN) == RCC_PLL3CFGR3_PLL3PDIVEN) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL3 FRACN Coefficient
  * @note   This API shall be called only when PLL3 is disabled.
  * @rmtoll PLL3CFGR2        PLL3DIVNFRAC    LL_RCC_PLL3_SetFRACN
  * @param  FRACN parameter can be a value between 0 and 2^24 (0xFFFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL3_SetFRACN(uint32_t FRACN)
{
  MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_PLL3DIVNFRAC, FRACN << RCC_PLL3CFGR2_PLL3DIVNFRAC_Pos);
}

/**
  * @brief  Get PLL3 FRACN Coefficient
  * @rmtoll PLL3CFGR2        PLL3DIVNFRAC    LL_RCC_PLL3_GetFRACN
  * @retval A value between 0 and 2^24 (0xFFFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL3_GetFRACN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL3CFGR2, RCC_PLL3CFGR2_PLL3DIVNFRAC) >> RCC_PLL3CFGR2_PLL3DIVNFRAC_Pos);
}

/**
  * @brief  Set the oscillator used as PLL clock source.
  * @note   PLL4SEL can be written only when All PLLs are disabled.
  * @rmtoll PLL4CFGR1      PLL4SEL        LL_RCC_PLL4_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_MSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  *         @arg @ref LL_RCC_PLLSOURCE_I2S_CKIN
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4SEL, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL clock source.
  * @rmtoll PLL4CFGR1      PLL4SEL        LL_RCC_PLL4_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLLSOURCE_HSI
  *         @arg @ref LL_RCC_PLLSOURCE_MSI
  *         @arg @ref LL_RCC_PLLSOURCE_HSE
  *         @arg @ref LL_RCC_PLLSOURCE_I2S_CKIN
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4SEL));
}

/**
  * @brief  Enable PLL4
  * @rmtoll CSR          PLL4ONS         LL_RCC_PLL4_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_Enable(void)
{
  WRITE_REG(RCC->CSR, RCC_CSR_PLL4ONS);
}

/**
  * @brief  Disable PLL4
  * @note Cannot be disabled if the PLL4 clock is used as the system clock
  * @rmtoll CCR          PLL4ONC         LL_RCC_PLL4_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_Disable(void)
{
  WRITE_REG(RCC->CCR, RCC_CCR_PLL4ONC);
}

/**
  * @brief  Check if PLL4 Ready
  * @rmtoll SR           PLL4RDY         LL_RCC_PLL4_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsReady(void)
{
  return ((READ_BIT(RCC->SR, RCC_SR_PLL4RDY) == (RCC_SR_PLL4RDY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL4 bypass (PLL4 output is driven by the PLL4 reference clock)
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR1    PLL4BYP         LL_RCC_PLL4_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_EnableBypass(void)
{
  SET_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4BYP);
}

/**
  * @brief  Disable PLL4 bypass (PLL4 output is driven by the VCO)
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR1    PLL4BYP         LL_RCC_PLL4_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_DisableBypass(void)
{
  CLEAR_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4BYP);
}

/**
  * @brief  Check if PLL4 bypass is enabled
  * @rmtoll PLL4CFGR1    PLL4BYP         LL_RCC_PLL4_IsEnabledBypass
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsEnabledBypass(void)
{
  return ((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4BYP) == RCC_PLL4CFGR1_PLL4BYP) ? 1UL : 0UL);
}

/**
  * @brief  Assert PLL4 modulation spread-spectrum reset
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4MODSSRST    LL_RCC_PLL4_AssertModulationSpreadSpectrumReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_AssertModulationSpreadSpectrumReset(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSSRST);
}

/**
  * @brief  Release PLL4 modulation spread-spectrum reset
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4MODSSRST    LL_RCC_PLL4_ReleaseModulationSpreadSpectrumReset
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_ReleaseModulationSpreadSpectrumReset(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSSRST);
}

/**
  * @brief  Enable PLL4 noise canceling DAC in fractional mode
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4DACEN       LL_RCC_PLL4_EnableDAC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_EnableDAC(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4DACEN);
}

/**
  * @brief  Disable PLL4 noise canceling DAC in fractional mode
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4DACEN     LL_RCC_PLL4_DisableDAC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_DisableDAC(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4DACEN);
}

/**
  * @brief  Check if PLL4 noise canceling DAC in fractional mode is enabled
  * @rmtoll PLL4CFGR3    PLL4DACEN     LL_RCC_PLL4_IsEnabledDAC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsEnabledDAC(void)
{
  return ((READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4DACEN) == RCC_PLL4CFGR3_PLL4DACEN) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL4 modulation spread-spectrum with fractional divide inactive
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4MODSSDIS    LL_RCC_PLL4_EnableModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_EnableModulationSpreadSpectrum(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSSDIS);
}

/**
  * @brief  Disable PLL4 modulation spread-spectrum but active fractional divide
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4MODSSDIS    LL_RCC_PLL4_DisableModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_DisableModulationSpreadSpectrum(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSSDIS);
}

/**
  * @brief  Check if PLL4 modulation spread-spectrum and inactive fractional divide is enabled
  * @rmtoll PLL4CFGR3    PLL4MODSSDIS    LL_RCC_PLL4_IsEnabledModulationSpreadSpectrum
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsEnabledModulationSpreadSpectrum(void)
{
  return ((READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODSSDIS) == 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL4 fractional divide and modulation spread-spectrum
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4MODDSEN     LL_RCC_PLL4_EnableFractionalModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_EnableFractionalModulationSpreadSpectrum(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODDSEN);
}

/**
  * @brief  Disable PLL4 fractional divide and modulation spread-spectrum
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4MODDSEN     LL_RCC_PLL4_DisableFractionalModulationSpreadSpectrum
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_DisableFractionalModulationSpreadSpectrum(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODDSEN);
}

/**
  * @brief  Check if PLL4 fractional divide and modulation spread-spectrum is enabled
  * @rmtoll PLL4CFGR3    PLL4MODDSEN     LL_RCC_PLL4_IsEnabledFractionalModulationSpreadSpectrum
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsEnabledFractionalModulationSpreadSpectrum(void)
{
  return ((READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4MODDSEN) == RCC_PLL4CFGR3_PLL4MODDSEN) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL4 DIVN Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR1    PLL4DIVN        LL_RCC_PLL4_SetN
  * @param  N  In integer mode, N parameter can be a value between 16 (0x10) and 2500 (0x9C4).
  *         In fractional mode, N parameter can be a value between 20 (0x14) and 500 (0x1F4).
  */
__STATIC_INLINE void LL_RCC_PLL4_SetN(uint32_t N)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4DIVN, N << RCC_PLL4CFGR1_PLL4DIVN_Pos);
}

/**
  * @brief  Get PLL4 DIVN Coefficient
  * @rmtoll PLL4CFGR1    PLL4DIVN        LL_RCC_PLL4_GetN
  * @retval In integer mode, a value between 16 (0x10) and 2500 (0x9C4).
  *         In fractional mode, a value between 20 (0x14) and 500 (0x1F4).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetN(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4DIVN) >> RCC_PLL4CFGR1_PLL4DIVN_Pos));
}

/**
  * @brief  Set PLL4 DIVM Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR1    PLL4DIVM        LL_RCC_PLL4_SetM
  * @param  M parameter can be a value between 1 and 63
  */
__STATIC_INLINE void LL_RCC_PLL4_SetM(uint32_t M)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4DIVM, M << RCC_PLL4CFGR1_PLL4DIVM_Pos);
}

/**
  * @brief  Get PLL4 DIVM Coefficient
  * @rmtoll PLL4CFGR1    PLL4DIVM        LL_RCC_PLL4_GetM
  * @retval A value between 1 and 63
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetM(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_PLL4DIVM) >> RCC_PLL4CFGR1_PLL4DIVM_Pos);
}

/**
  * @brief  Set PLL4 PDIV1 Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4PDIV1       LL_RCC_PLL4_SetP1
  * @param  P1 parameter can be a value between 1 and 7 when PLL4 is enabled, 0 when disabled
  */
__STATIC_INLINE void LL_RCC_PLL4_SetP1(uint32_t P1)
{
  MODIFY_REG(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIV1, P1 << RCC_PLL4CFGR3_PLL4PDIV1_Pos);
}

/**
  * @brief  Get PLL4 PDIV2 Coefficient
  * @rmtoll PLL4CFGR3    PLL4PDIV1       LL_RCC_PLL4_GetP1
  * @retval A value between 0 and 7
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetP1(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIV1) >> RCC_PLL4CFGR3_PLL4PDIV1_Pos);
}

/**
  * @brief  Set PLL4 PDIV2 Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3    PLL4PDIV2       LL_RCC_PLL4_SetP2
  * @param  P2 parameter can be a value between 1 and 7
  */
__STATIC_INLINE void LL_RCC_PLL4_SetP2(uint32_t P2)
{
  MODIFY_REG(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIV2, P2 << RCC_PLL4CFGR3_PLL4PDIV2_Pos);
}

/**
  * @brief  Get PLL4 PDIV2 Coefficient
  * @rmtoll PLL4CFGR3    PLL4PDIV2       LL_RCC_PLL4_GetP2
  * @retval A value between 1 and 7
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetP2(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIV2) >> RCC_PLL4CFGR3_PLL4PDIV2_Pos);
}

/**
  * @brief  Enable PLL4P
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3           PLL4PDIVEN         LL_RCC_PLL4P_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4P_Enable(void)
{
  SET_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIVEN);
}

/**
  * @brief  Disable PLL4P
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR3           PLL4PDIVEN         LL_RCC_PLL4P_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4P_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIVEN);
}

/**
  * @brief  Check if PLL4 P is enabled
  * @rmtoll PLL4CFGR3           PLL4PDIVEN         LL_RCC_PLL4P_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4P_IsEnabled(void)
{
  return ((READ_BIT(RCC->PLL4CFGR3, RCC_PLL4CFGR3_PLL4PDIVEN) == RCC_PLL4CFGR3_PLL4PDIVEN) ? 1UL : 0UL);
}

/**
  * @brief  Set PLL4 FRACN Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR2        PLL4DIVNFRAC    LL_RCC_PLL4_SetFRACN
  * @param  FRACN parameter can be a value between 0 and 2^24 (0xFFFFFF)
  */
__STATIC_INLINE void LL_RCC_PLL4_SetFRACN(uint32_t FRACN)
{
  MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_PLL4DIVNFRAC, FRACN << RCC_PLL4CFGR2_PLL4DIVNFRAC_Pos);
}

/**
  * @brief  Get PLL4 FRACN Coefficient
  * @rmtoll PLL4CFGR2        PLL4DIVNFRAC    LL_RCC_PLL4_GetFRACN
  * @retval A value between 0 and 2^24 (0xFFFFFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFRACN(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_PLL4DIVNFRAC) >> RCC_PLL4CFGR2_PLL4DIVNFRAC_Pos);
}

/**
  * @brief  Enable IC1
  * @rmtoll DIVENSR      IC1ENS        LL_RCC_IC1_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC1_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC1ENS);
}

/**
  * @brief  Disable IC1
  * @rmtoll DIVENCR      IC1ENC        LL_RCC_IC1_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC1_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC1ENC);
}

/**
  * @brief  Check if IC1 is enabled
  * @rmtoll DIVENR       IC1EN         LL_RCC_IC1_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC1_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC1EN) == RCC_DIVENR_IC1EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC1 clock source.
  * @rmtoll IC1CFGR      IC1SEL        LL_RCC_IC1_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC1_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC1CFGR, RCC_IC1CFGR_IC1SEL, Source);
}

