micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_rcc.h
/**
  * @brief  Get the PLL source used as IC1 clock source.
  * @rmtoll IC1CFGR      IC1SEL        LL_RCC_IC1_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC1_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC1CFGR, RCC_IC1CFGR_IC1SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC1CFGR      IC1INT        LL_RCC_IC1_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC1_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC1CFGR, RCC_IC1CFGR_IC1INT, (Divider - 1UL) << RCC_IC1CFGR_IC1INT_Pos);
}

/**
  * @brief  Get IC1 divider
  * @rmtoll IC1CFGR      IC1INT        LL_RCC_IC1_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC1_GetDivider(void)
{
  return ((READ_BIT(RCC->IC1CFGR, RCC_IC1CFGR_IC1INT) >> RCC_IC1CFGR_IC1INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC2
  * @rmtoll DIVENSR       IC2ENS        LL_RCC_IC2_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC2_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC2ENS);
}

/**
  * @brief  Disable IC2
  * @rmtoll DIVENCR       IC2ENC        LL_RCC_IC2_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC2_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC2ENC);
}

/**
  * @brief  Check if IC2 is enabled
  * @rmtoll DIVENR       IC2EN         LL_RCC_IC2_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC2_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC2EN) == RCC_DIVENR_IC2EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC2 clock source.
  * @rmtoll IC2CFGR      IC2SEL        LL_RCC_IC2_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC2_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC2CFGR, RCC_IC2CFGR_IC2SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC2 clock source.
  * @rmtoll IC2CFGR      IC2SEL        LL_RCC_IC2_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC2_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC2CFGR, RCC_IC2CFGR_IC2SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC2CFGR      IC2INT        LL_RCC_IC2_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC2_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC2CFGR, RCC_IC2CFGR_IC2INT, (Divider - 1UL) << RCC_IC2CFGR_IC2INT_Pos);
}

/**
  * @brief  Get IC2 divider
  * @rmtoll IC2CFGR      IC2INT        LL_RCC_IC2_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC2_GetDivider(void)
{
  return ((READ_BIT(RCC->IC2CFGR, RCC_IC2CFGR_IC2INT) >> RCC_IC2CFGR_IC2INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC3
  * @rmtoll DIVENSR       IC3ENS        LL_RCC_IC3_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC3_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC3ENS);
}

/**
  * @brief  Disable IC3
  * @rmtoll DIVENCR       IC3ENC        LL_RCC_IC3_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC3_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC3ENC);
}

/**
  * @brief  Check if IC3 is enabled
  * @rmtoll DIVENR       IC3EN         LL_RCC_IC3_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC3_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC3EN) == RCC_DIVENR_IC3EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC3 clock source.
  * @rmtoll IC3CFGR      IC3SEL        LL_RCC_IC3_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC3_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC3CFGR, RCC_IC3CFGR_IC3SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC3 clock source.
  * @rmtoll IC3CFGR      IC3SEL        LL_RCC_IC3_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC3_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC3CFGR, RCC_IC3CFGR_IC3SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC3CFGR      IC3INT        LL_RCC_IC3_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC3_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC3CFGR, RCC_IC3CFGR_IC3INT, (Divider - 1UL) << RCC_IC3CFGR_IC3INT_Pos);
}

/**
  * @brief  Get IC3 divider
  * @rmtoll IC3CFGR      IC3INT        LL_RCC_IC3_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC3_GetDivider(void)
{
  return ((READ_BIT(RCC->IC3CFGR, RCC_IC3CFGR_IC3INT) >> RCC_IC3CFGR_IC3INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC4
  * @rmtoll DIVENSR       IC4ENS        LL_RCC_IC4_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC4_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC4ENS);
}

/**
  * @brief  Disable IC4
  * @rmtoll DIVENCR       IC4ENC        LL_RCC_IC4_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC4_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC4ENC);
}

/**
  * @brief  Check if IC4 is enabled
  * @rmtoll DIVENR       IC4EN         LL_RCC_IC4_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC4_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC4EN) == RCC_DIVENR_IC4EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC4 clock source.
  * @rmtoll IC4CFGR      IC4SEL        LL_RCC_IC4_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC4_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC4CFGR, RCC_IC4CFGR_IC4SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC4 clock source.
  * @rmtoll IC4CFGR      IC4SEL        LL_RCC_IC4_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC4_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC4CFGR, RCC_IC4CFGR_IC4SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC4CFGR      IC4INT        LL_RCC_IC4_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC4_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC4CFGR, RCC_IC4CFGR_IC4INT, (Divider - 1UL) << RCC_IC4CFGR_IC4INT_Pos);
}

/**
  * @brief  Get IC4 divider
  * @rmtoll IC4CFGR      IC4INT        LL_RCC_IC4_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC4_GetDivider(void)
{
  return ((READ_BIT(RCC->IC4CFGR, RCC_IC4CFGR_IC4INT) >> RCC_IC4CFGR_IC4INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC5
  * @rmtoll DIVENSR       IC5ENS        LL_RCC_IC5_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC5_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC5ENS);
}

/**
  * @brief  Disable IC5
  * @rmtoll DIVENCR       IC5ENC        LL_RCC_IC5_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC5_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC5ENC);
}

/**
  * @brief  Check if IC5 is enabled
  * @rmtoll DIVENR       IC5EN         LL_RCC_IC5_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC5_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC5EN) == RCC_DIVENR_IC5EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC5 clock source.
  * @rmtoll IC5CFGR      IC5SEL        LL_RCC_IC5_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC5_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC5CFGR, RCC_IC5CFGR_IC5SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC5 clock source.
  * @rmtoll IC5CFGR      IC5SEL        LL_RCC_IC5_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC5_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC5CFGR, RCC_IC5CFGR_IC5SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC5CFGR      IC5INT        LL_RCC_IC5_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC5_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC5CFGR, RCC_IC5CFGR_IC5INT, (Divider - 1UL) << RCC_IC5CFGR_IC5INT_Pos);
}

/**
  * @brief  Get IC5 divider
  * @rmtoll IC5CFGR      IC5INT        LL_RCC_IC5_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC5_GetDivider(void)
{
  return ((READ_BIT(RCC->IC5CFGR, RCC_IC5CFGR_IC5INT) >> RCC_IC5CFGR_IC5INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC6
  * @rmtoll DIVENSR       IC6ENS        LL_RCC_IC6_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC6_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC6ENS);
}

/**
  * @brief  Disable IC6
  * @rmtoll DIVENCR       IC6ENC        LL_RCC_IC6_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC6_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC6ENC);
}

/**
  * @brief  Check if IC6 is enabled
  * @rmtoll DIVENR       IC6EN         LL_RCC_IC6_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC6_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC6EN) == RCC_DIVENR_IC6EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC6 clock source.
  * @rmtoll IC6CFGR      IC6SEL        LL_RCC_IC6_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC6_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC6CFGR, RCC_IC6CFGR_IC6SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC6 clock source.
  * @rmtoll IC6CFGR      IC6SEL        LL_RCC_IC6_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC6_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC6CFGR, RCC_IC6CFGR_IC6SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC6CFGR      IC6INT        LL_RCC_IC6_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC6_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC6CFGR, RCC_IC6CFGR_IC6INT, (Divider - 1UL) << RCC_IC6CFGR_IC6INT_Pos);
}

/**
  * @brief  Get IC6 divider
  * @rmtoll IC6CFGR      IC6INT        LL_RCC_IC6_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC6_GetDivider(void)
{
  return ((READ_BIT(RCC->IC6CFGR, RCC_IC6CFGR_IC6INT) >> RCC_IC6CFGR_IC6INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC7
  * @rmtoll DIVENSR       IC7ENS        LL_RCC_IC7_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC7_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC7ENS);
}

/**
  * @brief  Disable IC7
  * @rmtoll DIVENCR       IC7ENC        LL_RCC_IC7_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC7_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC7ENC);
}

/**
  * @brief  Check if IC7 is enabled
  * @rmtoll DIVENR       IC7EN         LL_RCC_IC7_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC7_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC7EN) == RCC_DIVENR_IC7EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC7 clock source.
  * @rmtoll IC7CFGR      IC7SEL        LL_RCC_IC7_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC7_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC7CFGR, RCC_IC7CFGR_IC7SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC7 clock source.
  * @rmtoll IC7CFGR      IC7SEL        LL_RCC_IC7_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC7_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC7CFGR, RCC_IC7CFGR_IC7SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC7CFGR      IC7INT        LL_RCC_IC7_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC7_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC7CFGR, RCC_IC7CFGR_IC7INT, (Divider - 1UL) << RCC_IC7CFGR_IC7INT_Pos);
}

/**
  * @brief  Get IC7 divider
  * @rmtoll IC7CFGR      IC7INT        LL_RCC_IC7_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC7_GetDivider(void)
{
  return ((READ_BIT(RCC->IC7CFGR, RCC_IC7CFGR_IC7INT) >> RCC_IC7CFGR_IC7INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC8
  * @rmtoll DIVENSR       IC8ENS        LL_RCC_IC8_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC8_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC8ENS);
}

/**
  * @brief  Disable IC8
  * @rmtoll DIVENCR       IC8ENC        LL_RCC_IC8_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC8_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC8ENC);
}

/**
  * @brief  Check if IC8 is enabled
  * @rmtoll DIVENR       IC8EN         LL_RCC_IC8_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC8_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC8EN) == RCC_DIVENR_IC8EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC8 clock source.
  * @rmtoll IC8CFGR      IC8SEL        LL_RCC_IC8_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC8_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC8CFGR, RCC_IC8CFGR_IC8SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC8 clock source.
  * @rmtoll IC8CFGR      IC8SEL        LL_RCC_IC8_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC8_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC8CFGR, RCC_IC8CFGR_IC8SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC8CFGR      IC8INT        LL_RCC_IC8_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC8_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC8CFGR, RCC_IC8CFGR_IC8INT, (Divider - 1UL) << RCC_IC8CFGR_IC8INT_Pos);
}

/**
  * @brief  Get IC8 divider
  * @rmtoll IC8CFGR      IC8INT        LL_RCC_IC8_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC8_GetDivider(void)
{
  return ((READ_BIT(RCC->IC8CFGR, RCC_IC8CFGR_IC8INT) >> RCC_IC8CFGR_IC8INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC9
  * @rmtoll DIVENSR       IC9ENS        LL_RCC_IC9_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC9_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC9ENS);
}

/**
  * @brief  Disable IC9
  * @rmtoll DIVENCR       IC9ENC        LL_RCC_IC9_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC9_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC9ENC);
}

/**
  * @brief  Check if IC9 is enabled
  * @rmtoll DIVENR       IC9EN         LL_RCC_IC9_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC9_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC9EN) == RCC_DIVENR_IC9EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC9 clock source.
  * @rmtoll IC9CFGR      IC9SEL        LL_RCC_IC9_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC9_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC9CFGR, RCC_IC9CFGR_IC9SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC9 clock source.
  * @rmtoll IC9CFGR      IC9SEL        LL_RCC_IC9_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC9_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC9CFGR, RCC_IC9CFGR_IC9SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC9CFGR      IC9INT        LL_RCC_IC9_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC9_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC9CFGR, RCC_IC9CFGR_IC9INT, (Divider - 1UL) << RCC_IC9CFGR_IC9INT_Pos);
}

/**
  * @brief  Get IC9 divider
  * @rmtoll IC9CFGR      IC9INT        LL_RCC_IC9_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC9_GetDivider(void)
{
  return ((READ_BIT(RCC->IC9CFGR, RCC_IC9CFGR_IC9INT) >> RCC_IC9CFGR_IC9INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC10
  * @rmtoll DIVENSR       IC10ENS        LL_RCC_IC10_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC10_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC10ENS);
}

/**
  * @brief  Disable IC10
  * @rmtoll DIVENCR       IC10ENC        LL_RCC_IC10_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC10_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC10ENC);
}

/**
  * @brief  Check if IC10 is enabled
  * @rmtoll DIVENR       IC10EN         LL_RCC_IC10_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC10_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC10EN) == RCC_DIVENR_IC10EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC10 clock source.
  * @rmtoll IC10CFGR      IC10SEL        LL_RCC_IC10_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC10_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC10CFGR, RCC_IC10CFGR_IC10SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC10 clock source.
  * @rmtoll IC10CFGR      IC10SEL        LL_RCC_IC10_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC10_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC10CFGR, RCC_IC10CFGR_IC10SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC10CFGR      IC10INT        LL_RCC_IC10_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC10_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC10CFGR, RCC_IC10CFGR_IC10INT, (Divider - 1UL) << RCC_IC10CFGR_IC10INT_Pos);
}

/**
  * @brief  Get IC10 divider
  * @rmtoll IC10CFGR      IC10INT        LL_RCC_IC10_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC10_GetDivider(void)
{
  return ((READ_BIT(RCC->IC10CFGR, RCC_IC10CFGR_IC10INT) >> RCC_IC10CFGR_IC10INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC11
  * @rmtoll DIVENSR       IC11ENS        LL_RCC_IC11_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC11_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC11ENS);
}

/**
  * @brief  Disable IC11
  * @rmtoll DIVENCR       IC11ENC        LL_RCC_IC11_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC11_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC11ENC);
}

/**
  * @brief  Check if IC11 is enabled
  * @rmtoll DIVENR       IC11EN         LL_RCC_IC11_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC11_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC11EN) == RCC_DIVENR_IC11EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC11 clock source.
  * @rmtoll IC11CFGR      IC11SEL        LL_RCC_IC11_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC11_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC11CFGR, RCC_IC11CFGR_IC11SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC11 clock source.
  * @rmtoll IC11CFGR      IC11SEL        LL_RCC_IC11_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC11_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC11CFGR, RCC_IC11CFGR_IC11SEL));
}

