micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_rcc.h
/**
  * @brief  Set  divider
  * @rmtoll IC11CFGR      IC11INT        LL_RCC_IC11_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC11_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC11CFGR, RCC_IC11CFGR_IC11INT, (Divider - 1UL) << RCC_IC11CFGR_IC11INT_Pos);
}

/**
  * @brief  Get IC11 divider
  * @rmtoll IC11CFGR      IC11INT        LL_RCC_IC11_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC11_GetDivider(void)
{
  return ((READ_BIT(RCC->IC11CFGR, RCC_IC11CFGR_IC11INT) >> RCC_IC11CFGR_IC11INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC12
  * @rmtoll DIVENSR       IC12ENS        LL_RCC_IC12_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC12_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC12ENS);
}

/**
  * @brief  Disable IC12
  * @rmtoll DIVENCR       IC12ENC        LL_RCC_IC12_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC12_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC12ENC);
}

/**
  * @brief  Check if IC12 is enabled
  * @rmtoll DIVENR       IC12EN         LL_RCC_IC12_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC12_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC12EN) == RCC_DIVENR_IC12EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC12 clock source.
  * @rmtoll IC12CFGR      IC12SEL        LL_RCC_IC12_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC12_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC12CFGR, RCC_IC12CFGR_IC12SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC12 clock source.
  * @rmtoll IC12CFGR      IC12SEL        LL_RCC_IC12_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC12_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC12CFGR, RCC_IC12CFGR_IC12SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC12CFGR      IC12INT        LL_RCC_IC12_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC12_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC12CFGR, RCC_IC12CFGR_IC12INT, (Divider - 1UL) << RCC_IC12CFGR_IC12INT_Pos);
}

/**
  * @brief  Get IC12 divider
  * @rmtoll IC12CFGR      IC12INT        LL_RCC_IC12_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC12_GetDivider(void)
{
  return ((READ_BIT(RCC->IC12CFGR, RCC_IC12CFGR_IC12INT) >> RCC_IC12CFGR_IC12INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC13
  * @rmtoll DIVENSR       IC13ENS        LL_RCC_IC13_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC13_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC13ENS);
}

/**
  * @brief  Disable IC13
  * @rmtoll DIVENCR       IC13ENC        LL_RCC_IC13_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC13_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC13ENC);
}

/**
  * @brief  Check if IC13 is enabled
  * @rmtoll DIVENR       IC13EN         LL_RCC_IC13_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC13_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC13EN) == RCC_DIVENR_IC13EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC13 clock source.
  * @rmtoll IC13CFGR      IC13SEL        LL_RCC_IC13_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC13_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC13CFGR, RCC_IC13CFGR_IC13SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC13 clock source.
  * @rmtoll IC13CFGR      IC13SEL        LL_RCC_IC13_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC13_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC13CFGR, RCC_IC13CFGR_IC13SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC13CFGR      IC13INT        LL_RCC_IC13_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC13_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC13CFGR, RCC_IC13CFGR_IC13INT, (Divider - 1UL) << RCC_IC13CFGR_IC13INT_Pos);
}

/**
  * @brief  Get IC13 divider
  * @rmtoll IC13CFGR      IC13INT        LL_RCC_IC13_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC13_GetDivider(void)
{
  return ((READ_BIT(RCC->IC13CFGR, RCC_IC13CFGR_IC13INT) >> RCC_IC13CFGR_IC13INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC14
  * @rmtoll DIVENSR       IC14ENS        LL_RCC_IC14_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC14_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC14ENS);
}

/**
  * @brief  Disable IC14
  * @rmtoll DIVENCR       IC14ENC        LL_RCC_IC14_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC14_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC14ENC);
}

/**
  * @brief  Check if IC14 is enabled
  * @rmtoll DIVENR       IC14EN         LL_RCC_IC14_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC14_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC14EN) == RCC_DIVENR_IC14EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC14 clock source.
  * @rmtoll IC14CFGR      IC14SEL        LL_RCC_IC14_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC14_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC14CFGR, RCC_IC14CFGR_IC14SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC14 clock source.
  * @rmtoll IC14CFGR      IC14SEL        LL_RCC_IC14_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC14_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC14CFGR, RCC_IC14CFGR_IC14SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC14CFGR      IC14INT        LL_RCC_IC14_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC14_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC14CFGR, RCC_IC14CFGR_IC14INT, (Divider - 1UL) << RCC_IC14CFGR_IC14INT_Pos);
}

/**
  * @brief  Get IC14 divider
  * @rmtoll IC14CFGR      IC14INT        LL_RCC_IC14_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC14_GetDivider(void)
{
  return ((READ_BIT(RCC->IC14CFGR, RCC_IC14CFGR_IC14INT) >> RCC_IC14CFGR_IC14INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC15
  * @rmtoll DIVENSR       IC15ENS        LL_RCC_IC15_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC15_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC15ENS);
}

/**
  * @brief  Disable IC15
  * @rmtoll DIVENCR       IC15ENC        LL_RCC_IC15_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC15_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC15ENC);
}

/**
  * @brief  Check if IC15 is enabled
  * @rmtoll DIVENR       IC15EN         LL_RCC_IC15_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC15_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC15EN) == RCC_DIVENR_IC15EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC15 clock source.
  * @rmtoll IC15CFGR      IC15SEL        LL_RCC_IC15_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC15_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC15CFGR, RCC_IC15CFGR_IC15SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC15 clock source.
  * @rmtoll IC15CFGR      IC15SEL        LL_RCC_IC15_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC15_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC15CFGR, RCC_IC15CFGR_IC15SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC15CFGR      IC15INT        LL_RCC_IC15_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC15_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC15CFGR, RCC_IC15CFGR_IC15INT, (Divider - 1UL) << RCC_IC15CFGR_IC15INT_Pos);
}

/**
  * @brief  Get IC15 divider
  * @rmtoll IC15CFGR      IC15INT        LL_RCC_IC15_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC15_GetDivider(void)
{
  return ((READ_BIT(RCC->IC15CFGR, RCC_IC15CFGR_IC15INT) >> RCC_IC15CFGR_IC15INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC16
  * @rmtoll DIVENSR       IC16ENS        LL_RCC_IC16_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC16_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC16ENS);
}

/**
  * @brief  Disable IC16
  * @rmtoll DIVENCR       IC16ENC        LL_RCC_IC16_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC16_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC16ENC);
}

/**
  * @brief  Check if IC16 is enabled
  * @rmtoll DIVENR       IC16EN         LL_RCC_IC16_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC16_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC16EN) == RCC_DIVENR_IC16EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC16 clock source.
  * @rmtoll IC16CFGR      IC16SEL        LL_RCC_IC16_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC16_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC16CFGR, RCC_IC16CFGR_IC16SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC16 clock source.
  * @rmtoll IC16CFGR      IC16SEL        LL_RCC_IC16_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC16_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC16CFGR, RCC_IC16CFGR_IC16SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC16CFGR      IC16INT        LL_RCC_IC16_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC16_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC16CFGR, RCC_IC16CFGR_IC16INT, (Divider - 1UL) << RCC_IC16CFGR_IC16INT_Pos);
}

/**
  * @brief  Get IC16 divider
  * @rmtoll IC16CFGR      IC16INT        LL_RCC_IC16_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC16_GetDivider(void)
{
  return ((READ_BIT(RCC->IC16CFGR, RCC_IC16CFGR_IC16INT) >> RCC_IC16CFGR_IC16INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC17
  * @rmtoll DIVENSR       IC17ENS        LL_RCC_IC17_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC17_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC17ENS);
}

/**
  * @brief  Disable IC17
  * @rmtoll DIVENCR       IC17ENC        LL_RCC_IC17_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC17_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC17ENC);
}

/**
  * @brief  Check if IC17 is enabled
  * @rmtoll DIVENR       IC17EN         LL_RCC_IC17_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC17_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC17EN) == RCC_DIVENR_IC17EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC17 clock source.
  * @rmtoll IC17CFGR      IC17SEL        LL_RCC_IC17_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC17_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC17CFGR, RCC_IC17CFGR_IC17SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC17 clock source.
  * @rmtoll IC17CFGR      IC17SEL        LL_RCC_IC17_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC17_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC17CFGR, RCC_IC17CFGR_IC17SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC17CFGR      IC17INT        LL_RCC_IC17_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC17_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC17CFGR, RCC_IC17CFGR_IC17INT, (Divider - 1UL) << RCC_IC17CFGR_IC17INT_Pos);
}

/**
  * @brief  Get IC17 divider
  * @rmtoll IC17CFGR      IC17INT        LL_RCC_IC17_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC17_GetDivider(void)
{
  return ((READ_BIT(RCC->IC17CFGR, RCC_IC17CFGR_IC17INT) >> RCC_IC17CFGR_IC17INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC18
  * @rmtoll DIVENSR       IC18ENS        LL_RCC_IC18_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC18_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC18ENS);
}

/**
  * @brief  Disable IC18
  * @rmtoll DIVENCR       IC18ENC        LL_RCC_IC18_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC18_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC18ENC);
}

/**
  * @brief  Check if IC18 is enabled
  * @rmtoll DIVENR       IC18EN         LL_RCC_IC18_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC18_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC18EN) == RCC_DIVENR_IC18EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC18 clock source.
  * @rmtoll IC18CFGR      IC18SEL        LL_RCC_IC18_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC18_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC18CFGR, RCC_IC18CFGR_IC18SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC18 clock source.
  * @rmtoll IC18CFGR      IC18SEL        LL_RCC_IC18_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC18_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC18CFGR, RCC_IC18CFGR_IC18SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC18CFGR      IC18INT        LL_RCC_IC18_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC18_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC18CFGR, RCC_IC18CFGR_IC18INT, (Divider - 1UL) << RCC_IC18CFGR_IC18INT_Pos);
}

/**
  * @brief  Get IC18 divider
  * @rmtoll IC18CFGR      IC18INT        LL_RCC_IC18_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC18_GetDivider(void)
{
  return ((READ_BIT(RCC->IC18CFGR, RCC_IC18CFGR_IC18INT) >> RCC_IC18CFGR_IC18INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC19
  * @rmtoll DIVENSR       IC19ENS        LL_RCC_IC19_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC19_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC19ENS);
}

/**
  * @brief  Disable IC19
  * @rmtoll DIVENCR       IC19ENC        LL_RCC_IC19_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC19_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC19ENC);
}

/**
  * @brief  Check if IC19 is enabled
  * @rmtoll DIVENR       IC19EN         LL_RCC_IC19_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC19_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC19EN) == RCC_DIVENR_IC19EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC19 clock source.
  * @rmtoll IC19CFGR      IC19SEL        LL_RCC_IC19_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC19_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC19CFGR, RCC_IC19CFGR_IC19SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC19 clock source.
  * @rmtoll IC19CFGR      IC19SEL        LL_RCC_IC19_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC19_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC19CFGR, RCC_IC19CFGR_IC19SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC19CFGR      IC19INT        LL_RCC_IC19_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC19_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC19CFGR, RCC_IC19CFGR_IC19INT, (Divider - 1UL) << RCC_IC19CFGR_IC19INT_Pos);
}

/**
  * @brief  Get IC19 divider
  * @rmtoll IC19CFGR      IC19INT        LL_RCC_IC19_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC19_GetDivider(void)
{
  return ((READ_BIT(RCC->IC19CFGR, RCC_IC19CFGR_IC19INT) >> RCC_IC19CFGR_IC19INT_Pos) + 1UL);
}

/**
  * @brief  Enable IC20
  * @rmtoll DIVENSR       IC20ENS        LL_RCC_IC20_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC20_Enable(void)
{
  WRITE_REG(RCC->DIVENSR, RCC_DIVENSR_IC20ENS);
}

/**
  * @brief  Disable IC20
  * @rmtoll DIVENCR       IC20ENC        LL_RCC_IC20_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC20_Disable(void)
{
  WRITE_REG(RCC->DIVENCR, RCC_DIVENCR_IC20ENC);
}

/**
  * @brief  Check if IC20 is enabled
  * @rmtoll DIVENR       IC20EN         LL_RCC_IC20_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IC20_IsEnabled(void)
{
  return ((READ_BIT(RCC->DIVENR, RCC_DIVENR_IC20EN) == RCC_DIVENR_IC20EN) ? 1UL : 0UL);
}

/**
  * @brief  Set the PLL source used as IC20 clock source.
  * @rmtoll IC20CFGR      IC20SEL        LL_RCC_IC20_SetSource
  * @param  Source parameter can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC20_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->IC20CFGR, RCC_IC20CFGR_IC20SEL, Source);
}

/**
  * @brief  Get the PLL source used as IC20 clock source.
  * @rmtoll IC20CFGR      IC20SEL        LL_RCC_IC20_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL1
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL2
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL3
  *         @arg @ref LL_RCC_ICCLKSOURCE_PLL4
  */
__STATIC_INLINE uint32_t LL_RCC_IC20_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->IC20CFGR, RCC_IC20CFGR_IC20SEL));
}

/**
  * @brief  Set  divider
  * @rmtoll IC20CFGR      IC20INT        LL_RCC_IC20_SetDivider
  * @param  Divider This parameter can be a value between 1 and 256.
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IC20_SetDivider(uint32_t Divider)
{
  MODIFY_REG(RCC->IC20CFGR, RCC_IC20CFGR_IC20INT, (Divider - 1UL) << RCC_IC20CFGR_IC20INT_Pos);
}

/**
  * @brief  Get IC20 divider
  * @rmtoll IC20CFGR      IC20INT        LL_RCC_IC20_GetDivider
  * @retval can be a value between 1 and 256.
  */
__STATIC_INLINE uint32_t LL_RCC_IC20_GetDivider(void)
{
  return ((READ_BIT(RCC->IC20CFGR, RCC_IC20CFGR_IC20INT) >> RCC_IC20CFGR_IC20INT_Pos) + 1UL);
}

/**
  * @brief  Enable CLKP
  * @rmtoll MISCENSR      PERENS        LL_RCC_CLKP_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CLKP_Enable(void)
{
  WRITE_REG(RCC->MISCENSR, RCC_MISCENSR_PERENS);
}

/**
  * @brief  Disable CLKP
  * @rmtoll MISCENCR      PERENC        LL_RCC_CLKP_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_CLKP_Disable(void)
{
  WRITE_REG(RCC->MISCENCR, RCC_MISCENCR_PERENC);
}

/**
  * @brief  Check if CLKP is enabled
  * @rmtoll MISCENR       PEREN         LL_RCC_CLKP_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_CLKP_IsEnabled(void)
{
  return ((READ_BIT(RCC->MISCENR, RCC_MISCENR_PEREN) == RCC_MISCENR_PEREN) ? 1UL : 0UL);
}

/**
  * @}
  */


